#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x8338 (0x8808 - 0x4D0)
// AnimBlueprintGeneratedClass B_MasterPetAnimBP.B_MasterPetAnimBP_C
class UB_MasterPetAnimBP_C : public UFortPetAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4D0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4D8(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0x4F8(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x600(0x20)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x620(0xA0)(None)
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_2;                            // 0x6C0(0x1B0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x870(0x108)(None)
	uint8                                        Pad_C74[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_1;                            // 0x980(0x1B0)(None)
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt;                              // 0xB30(0x1B0)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_1;                             // 0xCE0(0xF8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_167;                // 0xDD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_166;                // 0xE00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_165;                // 0xE28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_164;                // 0xE50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_163;                // 0xE78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_162;                // 0xEA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_161;                // 0xEC8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_160;                // 0xEF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_159;                // 0xF18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_158;                // 0xF40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_157;                // 0xF68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_156;                // 0xF90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_155;                // 0xFB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_154;                // 0xFE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_153;                // 0x1008(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_152;                // 0x1030(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_151;                // 0x1058(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_150;                // 0x1080(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_149;                // 0x10A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_148;                // 0x10D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_147;                // 0x10F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_146;                // 0x1120(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_145;                // 0x1148(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_144;                // 0x1170(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_143;                // 0x1198(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_142;                // 0x11C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_141;                // 0x11E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_140;                // 0x1210(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_139;                // 0x1238(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_138;                // 0x1260(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_137;                // 0x1288(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_136;                // 0x12B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_135;                // 0x12D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_134;                // 0x1300(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_133;                // 0x1328(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_132;                // 0x1350(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_131;                // 0x1378(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_130;                // 0x13A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_129;                // 0x13C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_128;                // 0x13F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_127;                // 0x1418(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_126;                // 0x1440(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_125;                // 0x1468(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_124;                // 0x1490(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_123;                // 0x14B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_122;                // 0x14E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_121;                // 0x1508(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_120;                // 0x1530(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_119;                // 0x1558(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_118;                // 0x1580(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_117;                // 0x15A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_116;                // 0x15D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_115;                // 0x15F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_114;                // 0x1620(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_113;                // 0x1648(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_112;                // 0x1670(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_111;                // 0x1698(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_110;                // 0x16C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_109;                // 0x16E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_108;                // 0x1710(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_107;                // 0x1738(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_106;                // 0x1760(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_105;                // 0x1788(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_104;                // 0x17B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_103;                // 0x17D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_102;                // 0x1800(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_101;                // 0x1828(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_100;                // 0x1850(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99;                 // 0x1878(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_98;                 // 0x18A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_97;                 // 0x18C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96;                 // 0x18F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95;                 // 0x1918(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_94;                 // 0x1940(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_93;                 // 0x1968(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_92;                 // 0x1990(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91;                 // 0x19B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_90;                 // 0x19E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_89;                 // 0x1A08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_88;                 // 0x1A30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_87;                 // 0x1A58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_86;                 // 0x1A80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85;                 // 0x1AA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_84;                 // 0x1AD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83;                 // 0x1AF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82;                 // 0x1B20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_81;                 // 0x1B48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_80;                 // 0x1B70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79;                 // 0x1B98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_78;                 // 0x1BC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77;                 // 0x1BE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_76;                 // 0x1C10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_75;                 // 0x1C38(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74;                 // 0x1C60(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_73;                 // 0x1C88(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_72;                 // 0x1CB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_71;                 // 0x1CD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_70;                 // 0x1D00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_69;                 // 0x1D28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_68;                 // 0x1D50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_67;                 // 0x1D78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_66;                 // 0x1DA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_65;                 // 0x1DC8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_64;                 // 0x1DF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_63;                 // 0x1E18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62;                 // 0x1E40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61;                 // 0x1E68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60;                 // 0x1E90(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_90;                   // 0x1EB8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_78;                      // 0x1F30(0x30)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x1F60(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_89;                   // 0x2000(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_88;                   // 0x2078(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_13;                    // 0x20F0(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_59;                 // 0x21B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_58;                 // 0x21E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57;                 // 0x2208(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56;                 // 0x2230(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_55;                 // 0x2258(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_54;                 // 0x2280(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_87;                   // 0x22A8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_77;                      // 0x2320(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_86;                   // 0x2350(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_76;                      // 0x23C8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_85;                   // 0x23F8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_75;                      // 0x2470(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_84;                   // 0x24A0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_74;                      // 0x2518(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_83;                   // 0x2548(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_73;                      // 0x25C0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_9;                      // 0x25F0(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_72;                      // 0x26A0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_82;                   // 0x26D0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_71;                      // 0x2748(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_81;                   // 0x2778(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_70;                      // 0x27F0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_80;                   // 0x2820(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_69;                      // 0x2898(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_79;                   // 0x28C8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_78;                   // 0x2940(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_12;                    // 0x29B8(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_68;                      // 0x2A80(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_53;                 // 0x2AB0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_77;                   // 0x2AD8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_67;                      // 0x2B50(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_76;                   // 0x2B80(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_66;                      // 0x2BF8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_75;                   // 0x2C28(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_65;                      // 0x2CA0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_74;                   // 0x2CD0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_64;                      // 0x2D48(0x30)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11;                    // 0x2D78(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_73;                   // 0x2E40(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_72;                   // 0x2EB8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_63;                      // 0x2F30(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_71;                   // 0x2F60(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_62;                      // 0x2FD8(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52;                 // 0x3008(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51;                 // 0x3030(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0x3058(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0x3080(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0x30A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0x30D0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_70;                   // 0x30F8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_61;                      // 0x3170(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_69;                   // 0x31A0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_60;                      // 0x3218(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_68;                   // 0x3248(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10;                    // 0x32C0(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_67;                   // 0x3388(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_59;                      // 0x3400(0x30)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0x3430(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_66;                   // 0x34F8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_65;                   // 0x3570(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_58;                      // 0x35E8(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8;                      // 0x3618(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_57;                      // 0x36C8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_64;                   // 0x36F8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_56;                      // 0x3770(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_63;                   // 0x37A0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_55;                      // 0x3818(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_62;                   // 0x3848(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_54;                      // 0x38C0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_61;                   // 0x38F0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_53;                      // 0x3968(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0x3998(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0x39C0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_60;                   // 0x39E8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_52;                      // 0x3A60(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0x3A90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0x3AB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0x3AE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0x3B08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0x3B30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0x3B58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0x3B80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0x3BA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x3BD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x3BF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x3C20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x3C48(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_59;                   // 0x3C70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_51;                      // 0x3CE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_58;                   // 0x3D18(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_50;                      // 0x3D90(0x30)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_49;                      // 0x3DC0(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x3DF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x3E18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x3E40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x3E68(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_57;                   // 0x3E90(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_48;                      // 0x3F08(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_56;                   // 0x3F38(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_47;                      // 0x3FB0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_55;                   // 0x3FE0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_46;                      // 0x4058(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x4088(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x40B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x40D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x4100(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x4128(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_54;                   // 0x4150(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_45;                      // 0x41C8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_53;                   // 0x41F8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_44;                      // 0x4270(0x30)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x42A0(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_52;                   // 0x4368(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_51;                   // 0x43E0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_43;                      // 0x4458(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50;                   // 0x4488(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49;                   // 0x4500(0x78)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_5;                    // 0x4578(0xA0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x4618(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_48;                   // 0x46E0(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47;                   // 0x4758(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_42;                      // 0x47D0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_46;                   // 0x4800(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_45;                   // 0x4878(0x78)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_4;                    // 0x48F0(0xA0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x4990(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_44;                   // 0x4A58(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43;                   // 0x4AD0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_41;                      // 0x4B48(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7;                      // 0x4B78(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_40;                      // 0x4C28(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6;                      // 0x4C58(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39;                      // 0x4D08(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42;                   // 0x4D38(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_38;                      // 0x4DB0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0x4DE0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_37;                      // 0x4E58(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5;                      // 0x4E88(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_36;                      // 0x4F38(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x4F68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x4F90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x4FB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x4FE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x5008(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0x5030(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_35;                      // 0x50A8(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x50D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x5100(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x5128(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x5150(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x5178(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x51A0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0x51C8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_34;                      // 0x5240(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x5270(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_33;                      // 0x52E8(0x30)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5;                  // 0x5318(0xE0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x53F8(0xE0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x54D8(0xC8)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x55A0(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x5668(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x5748(0xA0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x57E8(0xE0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_32;                      // 0x58C8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x58F8(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x5970(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x5A38(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x5AB0(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x5B78(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x5C58(0xA0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x5CF8(0xE0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_31;                      // 0x5DD8(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x5E08(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30;                      // 0x5EB8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x5EE8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_29;                      // 0x5F60(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x5F90(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_28;                      // 0x6008(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x6038(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_27;                      // 0x60B0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x60E0(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_26;                      // 0x6190(0x30)(None)
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer_1;                      // 0x61C0(0x68)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_25;                      // 0x6228(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x6258(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24;                      // 0x62D0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x6300(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_23;                      // 0x6378(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x63A8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x6420(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x6450(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x64C8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x64F8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x6570(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x65A0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x6618(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x6648(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x6670(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x6698(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x66C0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x66E8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x6760(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x6790(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x6808(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x6838(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x68B0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x68E0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x6958(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x6988(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x6A38(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x6A68(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x6AE0(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x6B58(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_3;                    // 0x6BF8(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x6C98(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x6D10(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x6D40(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x6DB8(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x6E30(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_2;                    // 0x6ED0(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x6F70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x6FE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x7018(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x7090(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x7108(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_1;                    // 0x71A8(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x7248(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x72C0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x72F0(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x7368(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x73E0(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0x7480(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x7520(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x7598(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x75C8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x7640(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x76B8(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x7780(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x77B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x77D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x7800(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x7828(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x7850(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x7878(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x78A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x78C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x78F0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x7918(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x7990(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x79C0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x7A38(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x7A68(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x7AE0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x7B10(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x7B88(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x7BB8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x7C30(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x7C60(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x7CD8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x7D08(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x7D80(0x30)(None)
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer;                        // 0x7DB0(0x68)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x7E18(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x7E48(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x7EF8(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x7F28(0xB0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x7FD8(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x80A0(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x8118(0x78)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x8190(0x48)(None)
	struct FAnimNode_PoseBlendNode               AnimGraphNode_PoseBlendNode;                       // 0x81D8(0x98)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK;                               // 0x8270(0xF8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x8368(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x8420(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x8448(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x8470(0xC0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x8530(0xA0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x85D0(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x8688(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x86B0(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x86D8(0xC0)(None)
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose;                        // 0x8798(0x18)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x87B0(0x30)(None)
	struct FVector                               PlayerLocation;                                    // 0x87E0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasPlayerLocationBeenSet;                         // 0x87EC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsJumpLandComplete_0;                             // 0x87ED(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_CB8[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        JumpIndex;                                         // 0x87F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DownSightsToLocomotionTimeRemaining;               // 0x87F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomIdle;                                        // 0x87F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomIdle2;                                       // 0x87FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HandIKWeight;                                      // 0x8800(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsMovingDuringJumpInitiated;                      // 0x8804(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsFox;                                            // 0x8805(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bAllowSkippingIdleToCrouchTransition;              // 0x8806(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bLobbySkyDive_IsDiving;                            // 0x8807(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UB_MasterPetAnimBP_C* GetDefaultObj();

	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_3C816C0C48CA2CAFFBF09392A11667F5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_E0DEFD6D4A6F7885EF0C1ABF6CCDE727();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_FE9887D54DE05D68FF6E8193A157347B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_685F2EBC4468C9B009E6B8B7D3AE964F();
