#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function F_MED_Desert_Ops_Camo_Hair_AnimBP.F_MED_Desert_Ops_Camo_Hair_AnimBP_C.AnimGraph
struct UF_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph_Params
{
public:
	struct FPoseLink                             AnimGraph;                                         // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0xA1 (0xA1 - 0x0)
// Function F_MED_Desert_Ops_Camo_Hair_AnimBP.F_MED_Desert_Ops_Camo_Hair_AnimBP_C.ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP
struct UF_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7209[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array;                            // 0x8(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array_1;                          // 0x18(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue; // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_1; // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_720A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array_2;                          // 0x30(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_2; // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_720B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array_3;                          // 0x48(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_3; // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_720C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array_4;                          // 0x60(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_4; // 0x70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_720D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array_5;                          // 0x78(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_5; // 0x88(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_720E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  K2Node_MakeArray_Array_6;                          // 0x90(0x10)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_6; // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}


