#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.OnNotifyEnd_F88BE42C41A5AE510872EBBFA6281EC7
struct UGA_Uncle_Brolly_DashEndingMontage_C_OnNotifyEnd_F88BE42C41A5AE510872EBBFA6281EC7_Params
{
public:
	struct FGameplayTag                          NotifyTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.OnNotifyBegin_F88BE42C41A5AE510872EBBFA6281EC7
struct UGA_Uncle_Brolly_DashEndingMontage_C_OnNotifyBegin_F88BE42C41A5AE510872EBBFA6281EC7_Params
{
public:
	struct FGameplayTag                          NotifyTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.OnCancelled_F88BE42C41A5AE510872EBBFA6281EC7
struct UGA_Uncle_Brolly_DashEndingMontage_C_OnCancelled_F88BE42C41A5AE510872EBBFA6281EC7_Params
{
public:
	struct FGameplayTag                          NotifyTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.OnInterrupted_F88BE42C41A5AE510872EBBFA6281EC7
struct UGA_Uncle_Brolly_DashEndingMontage_C_OnInterrupted_F88BE42C41A5AE510872EBBFA6281EC7_Params
{
public:
	struct FGameplayTag                          NotifyTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.OnBlendOut_F88BE42C41A5AE510872EBBFA6281EC7
struct UGA_Uncle_Brolly_DashEndingMontage_C_OnBlendOut_F88BE42C41A5AE510872EBBFA6281EC7_Params
{
public:
	struct FGameplayTag                          NotifyTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.OnCompleted_F88BE42C41A5AE510872EBBFA6281EC7
struct UGA_Uncle_Brolly_DashEndingMontage_C_OnCompleted_F88BE42C41A5AE510872EBBFA6281EC7_Params
{
public:
	struct FGameplayTag                          NotifyTag;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// 0xB0 (0xB0 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.K2_ActivateAbilityFromEvent
struct UGA_Uncle_Brolly_DashEndingMontage_C_K2_ActivateAbilityFromEvent_Params
{
public:
	struct FGameplayEventData                    EventData;                                         // 0x0(0xB0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x180 (0x180 - 0x0)
// Function GA_Uncle_Brolly_DashEndingMontage.GA_Uncle_Brolly_DashEndingMontage_C.ExecuteUbergraph_GA_Uncle_Brolly_DashEndingMontage
struct UGA_Uncle_Brolly_DashEndingMontage_C_ExecuteUbergraph_GA_Uncle_Brolly_DashEndingMontage_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          K2Node_CustomEvent_NotifyTag_5;                    // 0x4(0x8)(NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0xC(0x10)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                          K2Node_CustomEvent_NotifyTag_4;                    // 0x1C(0x8)(NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x24(0x10)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                          K2Node_CustomEvent_NotifyTag_3;                    // 0x34(0x8)(NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_2;            // 0x3C(0x10)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                          K2Node_CustomEvent_NotifyTag_2;                    // 0x4C(0x8)(NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_3;            // 0x54(0x10)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                          K2Node_CustomEvent_NotifyTag_1;                    // 0x64(0x8)(NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_4;            // 0x6C(0x10)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                          K2Node_CustomEvent_NotifyTag;                      // 0x7C(0x8)(NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_5;            // 0x84(0x10)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                          Temp_struct_Variable;                              // 0x94(0x8)(NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_617E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0xA8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6180[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_6;            // 0xAC(0x10)(ZeroConstructor, NoDestructor)
	uint8                                        Pad_6181[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilityTask_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue_1;                    // 0xC8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6182[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayEventData                    K2Node_Event_EventData;                            // 0xD0(0xB0)(ConstParm)
};

}
}


