#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1078 (0x13B8 - 0x340)
// ControlRigBlueprintGeneratedClass M_LRG_Buff_Cat_CrtlRig.M_LRG_Buff_Cat_CrtlRig_C
class UM_LRG_Buff_Cat_CrtlRig_C : public UControlRig
{
public:
	struct FRigUnit_BeginExecution               BeginExecution_0;                                  // 0x340(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                        Pad_71AF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigUnit_GetRelativeBoneTransform     GetRelativeBoneTransform_1_0_0;                    // 0x370(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler        MathQuaternionToEuler_0_0_0;                       // 0x3E0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0;                            // 0x420(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_0;                          // 0x460(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4;                            // 0x4A0(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_0;                          // 0x4F8(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetRelativeBoneTransform     GetRelativeBoneTransform_1_0_0_0;                  // 0x550(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler        MathQuaternionToEuler_0_0_0_0;                     // 0x5C0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_1;                          // 0x600(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_0_0;                        // 0x640(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_1;                          // 0x680(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_0_0;                        // 0x6D8(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform             GetBoneTransform_0;                                // 0x730(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform             GetBoneTransform_1;                                // 0x7A0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMakeRelative    MathTransformMakeRelative;                         // 0x810(0xB0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_0_0_0;                      // 0x8C0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_1_0;                        // 0x900(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorLength             MathVectorLength;                                  // 0x958(0x30)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                        Pad_71B2[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigUnit_GetBoneTransform             GetBoneTransform_0_0;                              // 0x990(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform             GetBoneTransform_1_0;                              // 0xA00(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMakeRelative    MathTransformMakeRelative_0;                       // 0xA70(0xB0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_0_0_0_0;                    // 0xB20(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_1_0_0;                      // 0xB60(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorLength             MathVectorLength_0;                                // 0xBB8(0x30)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                        Pad_71B3[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigUnit_GetRelativeBoneTransform     GetRelativeBoneTransform_1_0_0_2;                  // 0xBF0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler        MathQuaternionToEuler_0_0_0_2;                     // 0xC60(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_3;                          // 0xCA0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_0_1;                        // 0xCE0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_2;                          // 0xD20(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_0_2;                        // 0xD78(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetRelativeBoneTransform     GetRelativeBoneTransform_1_0_0_0_1;                // 0xDD0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler        MathQuaternionToEuler_0_0_0_0_1;                   // 0xE40(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_1_1;                        // 0xE80(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_0_0_1;                      // 0xEC0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_1_1;                        // 0xF00(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms         ModifyBoneTransforms_4_0_0_1;                      // 0xF58(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_TransformConstraint          TransformConstraint;                               // 0xFB0(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform             GetBoneTransform_3;                                // 0x10A0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform             GetBoneTransform_2_0;                              // 0x1110(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_TransformConstraint          TransformConstraint_0;                             // 0x1180(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetRelativeBoneTransform     GetRelativeBoneTransform;                          // 0x1270(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler        MathQuaternionToEuler_0_0_0_2_0;                   // 0x12E0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap               MathFloatRemap_0_0_0_0_3_0;                        // 0x1320(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatAbs                 MathFloatAbs_0;                                    // 0x1360(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatMul                 MathFloatMul;                                      // 0x1388(0x30)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UM_LRG_Buff_Cat_CrtlRig_C* GetDefaultObj();

};

}


