#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_6
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_6_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_5
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_5_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_4
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_3
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Midas;                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_0
struct USequenceDirector_C_BP_Elevator_Transition_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_1
struct USequenceDirector_C_BP_Elevator_Transition_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_2
struct USequenceDirector_C_BP_Elevator_Transition_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition3_Event_0
struct USequenceDirector_C_BP_Elevator_Transition3_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition3_Event_1
struct USequenceDirector_C_BP_Elevator_Transition3_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_3
struct USequenceDirector_C_BP_Elevator_Transition_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_4
struct USequenceDirector_C_BP_Elevator_Transition_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition3_Event_2
struct USequenceDirector_C_BP_Elevator_Transition3_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition3_Event_3
struct USequenceDirector_C_BP_Elevator_Transition3_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition3_Event_4
struct USequenceDirector_C_BP_Elevator_Transition3_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition3_Event_5
struct USequenceDirector_C_BP_Elevator_Transition3_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Hench_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Hench_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Hench;                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Audio Camera Move Event
struct USequenceDirector_C_Audio_Camera_Move_Event_Params
{
public:
	class USoundBase*                            Sound;                                             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_5
struct USequenceDirector_C_BP_Elevator_Transition_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_6
struct USequenceDirector_C_BP_Elevator_Transition_Event_6_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_7
struct USequenceDirector_C_BP_Elevator_Transition_Event_7_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_TNTINA_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_TNTINA_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_TNTINA;                // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_1
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_1_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Camera_Root_Movement_Event_0
struct USequenceDirector_C_Camera_Root_Movement_Event_0_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x9 (0x9 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Camera_Root_Movement_Event_1
struct USequenceDirector_C_Camera_Root_Movement_Event_1_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Adventure_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Adventure_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Adventure;             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_2
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_2_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Camera_Root_Movement_Event_2
struct USequenceDirector_C_Camera_Root_Movement_Event_2_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x9 (0x9 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Camera_Root_Movement_Event_3
struct USequenceDirector_C_Camera_Root_Movement_Event_3_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x9 (0x9 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Camera_Root_Movement_Event_4
struct USequenceDirector_C_Camera_Root_Movement_Event_4_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x9 (0x9 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.Camera_Root_Movement_Event_5
struct USequenceDirector_C_Camera_Root_Movement_Event_5_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_8
struct USequenceDirector_C_BP_Elevator_Transition_Event_8_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Elevator_Transition_Event_9
struct USequenceDirector_C_BP_Elevator_Transition_Event_9_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Midas_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Midas_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Midas;                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_3
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_3_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x140 (0x140 - 0x0)
// Function S12_Elevator_ToCatBurglarRoom.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
struct USequenceDirector_C_ExecuteUbergraph_SequenceDirector_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7176[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom; // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_9;       // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_8;       // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_7;       // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_5;      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_4;      // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_6;       // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_5;       // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_3;      // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_2;      // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_1;      // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3;        // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom_3; // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Hench; // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            K2Node_CustomEvent_Sound;                          // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_4;       // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_3;       // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_2;       // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_TNTINA; // 0x98(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom_2; // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue;                   // 0xA8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7177[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement_5;         // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn_5;                    // 0xB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsReversed_ReturnValue_1;                 // 0xB9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7178[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement_4;         // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn_4;                    // 0xC8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7179[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Adventure; // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom_1; // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue_2;                 // 0xE0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_717A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement_3;         // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn_3;                    // 0xF0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsReversed_ReturnValue_3;                 // 0xF1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_717B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement_2;         // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn_2;                    // 0x100(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_717C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement_1;         // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn_1;                    // 0x110(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_717D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement;           // 0x118(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn;                      // 0x120(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_717E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_1;       // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition;         // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Midas; // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


