#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_0
struct USequenceDirector_C_BP_Elevator_Transition_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_1
struct USequenceDirector_C_BP_Elevator_Transition_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_2
struct USequenceDirector_C_BP_Elevator_Transition_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition3_Event_0
struct USequenceDirector_C_BP_Elevator_Transition3_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition3_Event_1
struct USequenceDirector_C_BP_Elevator_Transition3_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_3
struct USequenceDirector_C_BP_Elevator_Transition_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_4
struct USequenceDirector_C_BP_Elevator_Transition_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition3_Event_2
struct USequenceDirector_C_BP_Elevator_Transition3_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition3_Event_3
struct USequenceDirector_C_BP_Elevator_Transition3_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_5
struct USequenceDirector_C_BP_Elevator_Transition_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition_Event_6
struct USequenceDirector_C_BP_Elevator_Transition_Event_6_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.BP_Elevator_Transition3_Event_4
struct USequenceDirector_C_BP_Elevator_Transition3_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.Audio Camera Move Event
struct USequenceDirector_C_Audio_Camera_Move_Event_Params
{
public:
	class USoundBase*                            Sound;                                             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x70 (0x70 - 0x0)
// Function S12_BuffCatRoom_ToFactionSelect.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
struct USequenceDirector_C_ExecuteUbergraph_SequenceDirector_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_724D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            K2Node_CustomEvent_Sound;                          // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_6;       // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_5;       // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_4;       // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_4;      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_3;      // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_3;       // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_2;       // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_2;      // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_1;      // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_1;       // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition;         // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3;        // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


