#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_15
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_15_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_14
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_14_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher2;                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_13
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_13_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_12
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_12_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_11
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_11_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_10
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_10_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_9
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_9_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_8
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_8_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_7
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_7_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_6
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_6_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_4
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_3
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_2
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_0
struct USequenceDirector_C_BP_Elevator_Transition4_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_1
struct USequenceDirector_C_BP_Elevator_Transition4_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_2
struct USequenceDirector_C_BP_Elevator_Transition4_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_3
struct USequenceDirector_C_BP_Elevator_Transition4_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_4
struct USequenceDirector_C_BP_Elevator_Transition4_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_0
struct USequenceDirector_C_BP_Elevator_Transition2_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_1
struct USequenceDirector_C_BP_Elevator_Transition2_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_2
struct USequenceDirector_C_BP_Elevator_Transition2_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_5
struct USequenceDirector_C_BP_Elevator_Transition4_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_6
struct USequenceDirector_C_BP_Elevator_Transition4_Event_6_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_7
struct USequenceDirector_C_BP_Elevator_Transition4_Event_7_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_8
struct USequenceDirector_C_BP_Elevator_Transition4_Event_8_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_3
struct USequenceDirector_C_BP_Elevator_Transition2_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_4
struct USequenceDirector_C_BP_Elevator_Transition2_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_5
struct USequenceDirector_C_BP_Elevator_Transition2_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_6
struct USequenceDirector_C_BP_Elevator_Transition2_Event_6_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_7
struct USequenceDirector_C_BP_Elevator_Transition2_Event_7_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition2_Event_8
struct USequenceDirector_C_BP_Elevator_Transition2_Event_8_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition2;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_9
struct USequenceDirector_C_BP_Elevator_Transition4_Event_9_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_10
struct USequenceDirector_C_BP_Elevator_Transition4_Event_10_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_11
struct USequenceDirector_C_BP_Elevator_Transition4_Event_11_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_12
struct USequenceDirector_C_BP_Elevator_Transition4_Event_12_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_13
struct USequenceDirector_C_BP_Elevator_Transition4_Event_13_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Elevator_Transition4_Event_14
struct USequenceDirector_C_BP_Elevator_Transition4_Event_14_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition4;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher2_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher2_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher2;                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher2_Event_1
struct USequenceDirector_C_BP_Battlepass_LightSwitcher2_Event_1_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher2;                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher2_Event_2
struct USequenceDirector_C_BP_Battlepass_LightSwitcher2_Event_2_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher2;                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher2_Event_3
struct USequenceDirector_C_BP_Battlepass_LightSwitcher2_Event_3_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher2;                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_1
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_1_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.BP_Battlepass_LightSwitcher2_Event_4
struct USequenceDirector_C_BP_Battlepass_LightSwitcher2_Event_4_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher2;                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.Audio Camera Movemt Event
struct USequenceDirector_C_Audio_Camera_Movemt_Event_Params
{
public:
	class USoundBase*                            Sound;                                             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.Camera_Root_Movement_Event_0
struct USequenceDirector_C_Camera_Root_Movement_Event_0_Params
{
public:
	class AFrontend_EventLevel_Camera_C*         Camera_Root_Movement;                              // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStreamIn;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x11A (0x11A - 0x0)
// Function S12_MainRoom_ToChangingRoom.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
struct USequenceDirector_C_ExecuteUbergraph_SequenceDirector_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7171[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFrontend_EventLevel_Camera_C*         K2Node_CustomEvent_Camera_Root_Movement;           // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bStreamIn;                      // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7172[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_14;     // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_13;     // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_12;     // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_11;     // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_10;     // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_8;      // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_7;      // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_6;      // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_9;      // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_8;      // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_7;      // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_6;      // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_5;      // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_4;      // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_3;      // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_2;      // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2_1;      // 0x98(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition2;        // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_5;      // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_4;      // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_3;      // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_2;      // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4_1;      // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition4;        // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher2_4; // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher2_3; // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher2_2; // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher2_1; // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom_1; // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom; // 0x100(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher2;   // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            K2Node_CustomEvent_Sound;                          // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue;                   // 0x118(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsReversed_ReturnValue_1;                 // 0x119(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}


