#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Meowscles;             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_0
struct USequenceDirector_C_BP_Elevator_Transition_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_1
struct USequenceDirector_C_BP_Elevator_Transition_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_2
struct USequenceDirector_C_BP_Elevator_Transition_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition3_Event_0
struct USequenceDirector_C_BP_Elevator_Transition3_Event_0_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition3_Event_1
struct USequenceDirector_C_BP_Elevator_Transition3_Event_1_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_3
struct USequenceDirector_C_BP_Elevator_Transition_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_4
struct USequenceDirector_C_BP_Elevator_Transition_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition3_Event_2
struct USequenceDirector_C_BP_Elevator_Transition3_Event_2_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition3_Event_3
struct USequenceDirector_C_BP_Elevator_Transition3_Event_3_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition3_Event_4
struct USequenceDirector_C_BP_Elevator_Transition3_Event_4_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition3_Event_5
struct USequenceDirector_C_BP_Elevator_Transition3_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition3;                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Battlepass_LightSwitcher_Hench_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Hench_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Hench;                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.Audio Camera Move Event
struct USequenceDirector_C_Audio_Camera_Move_Event_Params
{
public:
	class USoundBase*                            Sound;                                             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_5
struct USequenceDirector_C_BP_Elevator_Transition_Event_5_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_6
struct USequenceDirector_C_BP_Elevator_Transition_Event_6_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Elevator_Transition_Event_7
struct USequenceDirector_C_BP_Elevator_Transition_Event_7_Params
{
public:
	class ABP_Elevator_Transition_C*             BP_Elevator_Transition;                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Battlepass_LightSwitcher_TNTINA_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_TNTINA_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_TNTINA;                // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_1
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_1_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Battlepass_LightSwitcher_Meowscles_Event_0
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Meowscles_Event_0_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Meowscles;             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.BP_Battlepass_LightSwitcher_Maproom_Event_2
struct USequenceDirector_C_BP_Battlepass_LightSwitcher_Maproom_Event_2_Params
{
public:
	class ABP_Battlepass_LightSwitcher_C*        BP_Battlepass_LightSwitcher_Maproom;               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC1 (0xC1 - 0x0)
// Function S12_BuffcatRoom_ToElevator.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
struct USequenceDirector_C_ExecuteUbergraph_SequenceDirector_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue;                   // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7192[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_7;       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_6;       // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_5;       // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_5;      // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_4;      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_4;       // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_3;       // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_3;      // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_2;      // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3_1;      // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition3;        // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom_2; // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Hench; // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            K2Node_CustomEvent_Sound;                          // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_2;       // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition_1;       // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Elevator_Transition_C*             K2Node_CustomEvent_BP_Elevator_Transition;         // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_TNTINA; // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom_1; // 0x98(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue_1;                 // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_719A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Meowscles; // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue_2;                 // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_719C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Battlepass_LightSwitcher_C*        K2Node_CustomEvent_BP_Battlepass_LightSwitcher_Maproom; // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsReversed_ReturnValue_3;                 // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}


